DanielR92/CMT2300A/RP2040/main.cpp
#define CMT2300A_MASK_TX_DONE_FLG       0x08
#define CMT2300A_MASK_PKT_OK_FLG        0x01

#define CRC8_INIT                       0x00
#define CRC8_POLY                       0x01

#define CRC16_MODBUS_POLYNOM            0xA001

#define U32_B3(val) ((uint8_t)((val >> 24) & 0xff))
#define U32_B2(val) ((uint8_t)((val >> 16) & 0xff))
#define U32_B1(val) ((uint8_t)((val >>  8) & 0xff))
#define U32_B0(val) ((uint8_t)((val      ) & 0xff))

#ifdef RP2040
    typedef RP2040Spi3w SpiType;
#else // ESP32
    typedef esp32_3wSpi SpiType;
    //typedef SoftSpi3w<DEF_CS_PIN, DEF_FCS_PIN, DEF_SCK_PIN, DEF_SDIO_PIN> SpiType;
#endif

SpiType spi3w;
uint32_t cnt;

uint8_t mLastFreq;
uint8_t mStartFreq;
uint8_t mEndFreq;
bool mFound;
uint32_t mPrevMillis;
uint8_t mDec;

uint8_t mRec[10][32];
uint8_t mRecId;
int8_t mRssi[10];
uint32_t mRxtime[10];
bool mRxFrag[10];
uint8_t mRetransmits;
uint8_t mMaxFragId;
uint8_t mLastRecId;
bool mGotIntr;

void rxLoop(void);

uint8_t getChipStatus(void) {
    return spi3w.readReg(CMT2300A_CUS_MODE_STA) & CMT2300A_MASK_CHIP_MODE_STA;
}

//-----------------------------------------------------------------------------
uint8_t crc8(uint8_t buf[], uint8_t len) {
    uint8_t crc = CRC8_INIT;
    for(uint8_t i = 0; i < len; i++) {
        crc ^= buf[i];
        for(uint8_t b = 0; b < 8; b ++) {
            crc = (crc << 1) ^ ((crc & 0x80) ? CRC8_POLY : 0x00);
        }
    }
    return crc;
}

//-----------------------------------------------------------------------------
uint16_t crc16(uint8_t buf[], uint8_t len, uint16_t start) {
    uint16_t crc = start;
    uint8_t shift = 0;

    for(uint8_t i = 0; i < len; i ++) {
        crc = crc ^ buf[i];
        for(uint8_t bit = 0; bit < 8; bit ++) {
            shift = (crc & 0x0001);
            crc = crc >> 1;
            if(shift != 0)
                crc = crc ^ CRC16_MODBUS_POLYNOM;
        }
    }
    return crc;
}

//-----------------------------------------------------------------------------
void dumpBuf(const char* des, uint8_t buf[], uint8_t len, bool newline = true) {
    //Serial.println("------------------");
    Serial.print(String(des));
    for(uint8_t i = 0; i < len; i++) {
        if((0 != i) && (i % 32 == 0))
            Serial.println("");
        if(buf[i] < 16)
            Serial.print(" 0" + String(buf[i], HEX));
        else
            Serial.print(" " + String(buf[i], HEX));
    }
    if(newline)
        Serial.println("");
}

//-----------------------------------------------------------------------------
bool cmtSwitchStatus(uint8_t cmd, uint8_t waitFor, uint16_t cycles = 50000) {
    spi3w.writeReg(CMT2300A_CUS_MODE_CTL, cmd);
    while(cycles--) {
        delayMicroseconds(10);
        if(waitFor == (getChipStatus() & waitFor))
            return true;
    }
    Serial.println("status wait for: " + String(waitFor, HEX) + " read: " + String(getChipStatus(), HEX));
    return false;
}

//-----------------------------------------------------------------------------
void freqSetting(uint8_t setting, bool send7A = true) {
    if(!cmtSwitchStatus(CMT2300A_GO_STBY, CMT2300A_STA_STBY))
        Serial.println("warn: not switched to standby mode!");

    //if(0 == setting) { // 863MHz
        spi3w.writeReg(0x18, 0x42);
        spi3w.writeReg(0x19, 0x6D);
        spi3w.writeReg(0x1A, 0x80);
        spi3w.writeReg(0x1B, 0x86);
        spi3w.writeReg(0x1C, 0x42);
        spi3w.writeReg(0x1D, 0x62);
        spi3w.writeReg(0x1E, 0x27);
        spi3w.writeReg(0x1F, 0x16);
    /*} else if(1 == setting) { // 871MHz
        spi3w.writeReg(0x18, 0x42);
        spi3w.writeReg(0x19, 0xA9);
        spi3w.writeReg(0x1A, 0xA4);
        spi3w.writeReg(0x1B, 0x8C);
        spi3w.writeReg(0x1C, 0x42);
        spi3w.writeReg(0x1D, 0x9E);
        spi3w.writeReg(0x1E, 0x4B);
        spi3w.writeReg(0x1F, 0x1C);
    } else if(2 == setting) { // 872MHz
        spi3w.writeReg(0x18, 0x42);
        spi3w.writeReg(0x19, 0x0b);
        spi3w.writeReg(0x1A, 0xcc);
        spi3w.writeReg(0x1B, 0x82);
        spi3w.writeReg(0x1C, 0x42);
        spi3w.writeReg(0x1D, 0x00);
        spi3w.writeReg(0x1E, 0x73);
        spi3w.writeReg(0x1F, 0x12);
    }*/
    if(send7A)
        spi3w.writeReg(0x27, 0x0A);


    if(!cmtSwitchStatus(CMT2300A_GO_SLEEP, CMT2300A_STA_SLEEP))
        Serial.println("warn: not switched to sleep mode!");
}

//-----------------------------------------------------------------------------
void switchFreq(void) {
    if(++mLastFreq > mEndFreq)
        mLastFreq = mStartFreq;

    //mLastFreq = 0x00;

    // 0: 868.00MHz
    // 1: 868.23MHz
    // 2: 868.46MHz
    // 3: 868.72MHz
    // 4: 868.97MHz
    spi3w.writeReg(CMT2300A_CUS_FREQ_CHNL, mLastFreq);
}

//-----------------------------------------------------------------------------
void printVal(uint8_t pay[], uint8_t offs, uint8_t len, uint16_t div, const char* des, const char* unit, bool isUnsigned = true) {
    uint32_t tmp = pay[offs];
    for(uint8_t i = 1; i < len; i++) {
        tmp <<= 8;
        tmp |= pay[offs+i];
    }
    char info[30] = {0};
    if(isUnsigned)
        snprintf(info, 30, "%s: %.2f%s", des, (float)tmp/(float)div, unit);
    else
        snprintf(info, 30, "%s: %.2f%s", des, ((float)((int16_t)tmp))/(float)div, unit);
    Serial.println(String(info));
}

//-----------------------------------------------------------------------------
void build() {
    uint8_t payload[200];
    memset(payload, 0xcc, 200);

    uint8_t pos = 0;
    uint8_t len = 0;

    for(uint8_t i = 0; i < mMaxFragId; i++) {
        len = mRec[i][0]-1-10;
        memcpy(&payload[pos], &mRec[i][11], len);
        pos += len;
    }

    //dump(payload, pos);
    uint16_t crc = crc16(payload, pos-2, 0xffff);
    uint16_t recCrc = (payload[pos-2] << 8) | payload[pos-1];
    //Serial.println("crc16: 0x" + String(crc, HEX) + " " + String(recCrc, HEX));
    //Serial.println("len: " + String(pos-2));

    if(crc == recCrc) {
        if(HMS500 == wrType) {
            printVal(payload,  2, 2,   10, "CH1 - U  ", "V");
            printVal(payload,  4, 2,  100, "CH1 - I  ", "A");
            printVal(payload,  6, 2,   10, "CH1 - P  ", "W");
            printVal(payload,  8, 4, 1000, "CH1 - YT ", "kWh");
            printVal(payload, 12, 2,    1, "CH1 - YD ", "Wh");

            printVal(payload, 14, 2,   10, "CH0 - U  ", "V");
            printVal(payload, 16, 2,  100, "CH0 - F  ", "Hz");
            printVal(payload, 18, 2,   10, "CH0 - P  ", "W");
            printVal(payload, 20, 2,   10, "CH0 - Q  ", "var", false);
            printVal(payload, 22, 2,  100, "CH0 - I  ", "A");
            printVal(payload, 24, 2, 1000, "CH0 - PF ", "");
            printVal(payload, 26, 2,   10, "CH0 - T  ", "°C", false);
            printVal(payload, 28, 2,    1, "CH0 - EVT", "");
        }
        else if(HMS1000 == wrType) {
            printVal(payload,  2, 2,   10, "CH1 - U  ", "V");
            printVal(payload,  4, 2,   10, "CH2 - U  ", "V");
            printVal(payload,  6, 2,  100, "CH1 - I  ", "A");
            printVal(payload,  8, 2,  100, "CH2 - I  ", "A");
            printVal(payload, 10, 2,   10, "CH1 - P  ", "W");
            printVal(payload, 12, 2,   10, "CH2 - P  ", "W");
            printVal(payload, 14, 4, 1000, "CH1 - YT ", "kWh");
            printVal(payload, 18, 4, 1000, "CH2 - YT ", "kWh");
            printVal(payload, 22, 2,    1, "CH1 - YD ", "Wh");
            printVal(payload, 24, 2,    1, "CH2 - YD ", "Wh");

