DanielR92/CMT2300A/RP2040/main.cpp
            printVal(payload, 26, 2,   10, "CH0 - U  ", "V");
            printVal(payload, 28, 2,  100, "CH0 - F  ", "Hz");
            printVal(payload, 30, 2,   10, "CH0 - P  ", "W");
            printVal(payload, 32, 2,   10, "CH0 - Q  ", "var", false);
            printVal(payload, 34, 2,  100, "CH0 - I  ", "A");
            printVal(payload, 36, 2, 1000, "CH0 - PF ", "");
            printVal(payload, 38, 2,   10, "CH0 - T  ", "°C", false);
            printVal(payload, 40, 2,    1, "CH0 - EVT", "");
        }
        else if(HMS2000 == wrType) {
            printVal(payload,  2, 2,   10, "CH1 - U  ", "V");
            printVal(payload,  4, 2,   10, "CH2 - U  ", "V");
            printVal(payload,  6, 2,  100, "CH1 - I  ", "A");
            printVal(payload,  8, 2,  100, "CH2 - I  ", "A");
            printVal(payload, 10, 2,   10, "CH1 - P  ", "W");
            printVal(payload, 12, 2,   10, "CH2 - P  ", "W");
            printVal(payload, 14, 4, 1000, "CH1 - YT ", "kWh");
            printVal(payload, 18, 4, 1000, "CH2 - YT ", "kWh");
            printVal(payload, 22, 2,    1, "CH1 - YD ", "Wh");
            printVal(payload, 24, 2,    1, "CH2 - YD ", "Wh");

            printVal(payload, 26, 2,   10, "CH3 - U  ", "V");
            printVal(payload, 28, 2,   10, "CH4 - U  ", "V");
            printVal(payload, 30, 2,  100, "CH3 - I  ", "A");
            printVal(payload, 32, 2,  100, "CH4 - I  ", "A");
            printVal(payload, 34, 2,   10, "CH3 - P  ", "W");
            printVal(payload, 36, 2,   10, "CH4 - P  ", "W");
            printVal(payload, 38, 4, 1000, "CH3 - YT ", "kWh");
            printVal(payload, 42, 4, 1000, "CH4 - YT ", "kWh");
            printVal(payload, 46, 2,    1, "CH3 - YD ", "Wh");
            printVal(payload, 48, 2,    1, "CH4 - YD ", "Wh");

            printVal(payload, 50, 2,   10, "CH0 - U  ", "V");
            printVal(payload, 52, 2,  100, "CH0 - F  ", "Hz");
            printVal(payload, 54, 2,   10, "CH0 - P  ", "W");
            printVal(payload, 56, 2,   10, "CH0 - Q  ", "var", false);
            printVal(payload, 58, 2,  100, "CH0 - I  ", "A");
            printVal(payload, 60, 2, 1000, "CH0 - PF ", "");
            printVal(payload, 62, 2,   10, "CH0 - T  ", "°C", false);
            printVal(payload, 64, 2,    1, "CH0 - EVT", "");
        } else if(HMT2250 == wrType) {
            printVal(payload,  2, 2,   10, "CH1+2 - U    ", "V");
            printVal(payload,  4, 2,  100, "CH1   - I    ", "A");
            printVal(payload,  6, 2,  100, "CH2   - I    ", "A");
            printVal(payload,  8, 2,   10, "CH1   - P    ", "W");
            printVal(payload, 10, 2,   10, "CH2   - P    ", "W");
            printVal(payload, 12, 4, 1000, "CH1   - YT   ", "kWh");
            printVal(payload, 16, 4, 1000, "CH2   - YT   ", "kWh");
            printVal(payload, 20, 2,    1, "CH1   - YD   ", "Wh");
            printVal(payload, 22, 2,    1, "CH2   - YD   ", "Wh");

            printVal(payload, 24, 2,   10, "CH3+4 - U    ", "V");
            printVal(payload, 26, 2,  100, "CH3   - I    ", "A");
            printVal(payload, 28, 2,  100, "CH4   - I    ", "A");
            printVal(payload, 30, 2,   10, "CH3   - P    ", "W");
            printVal(payload, 32, 2,   10, "CH4   - P    ", "W");
            printVal(payload, 34, 4, 1000, "CH3   - YT   ", "kWh");
            printVal(payload, 38, 4, 1000, "CH4   - YT   ", "kWh");
            printVal(payload, 42, 2,    1, "CH3   - YD   ", "Wh");
            printVal(payload, 44, 2,    1, "CH4   - YD   ", "Wh");

            printVal(payload, 46, 2,   10, "CH5+6 - U    ", "V");
            printVal(payload, 48, 2,  100, "CH5   - I    ", "A");
            printVal(payload, 50, 2,  100, "CH6   - I    ", "A");
            printVal(payload, 52, 2,   10, "CH5   - P    ", "W");
            printVal(payload, 54, 2,   10, "CH6   - P    ", "W");
            printVal(payload, 56, 4, 1000, "CH5   - YT   ", "kWh");
            printVal(payload, 60, 4, 1000, "CH6   - YT   ", "kWh");
            printVal(payload, 64, 2,    1, "CH5   - YD   ", "Wh");
            printVal(payload, 66, 2,    1, "CH6   - YD   ", "Wh");

            printVal(payload, 68, 2,   10, "CH0   - U_1-N", "V");
            printVal(payload, 70, 2,   10, "CH0   - U_2-N", "V");
            printVal(payload, 72, 2,   10, "CH0   - U_3-N", "V");
            printVal(payload, 74, 2,   10, "CH0   - U_1-2", "V");
            printVal(payload, 76, 2,   10, "CH0   - U_2-3", "V");
            printVal(payload, 78, 2,   10, "CH0   - U_3-1", "V");
            printVal(payload, 80, 2,  100, "CH0   - F    ", "Hz");
            printVal(payload, 82, 2,   10, "CH0   - P    ", "W");
            printVal(payload, 84, 2,   10, "CH0   - Q    ", "var", false);
            printVal(payload, 86, 2,  100, "CH0   - I1   ", "A");
            printVal(payload, 88, 2,  100, "CH0   - I2   ", "A");
            printVal(payload, 90, 2,  100, "CH0   - I3   ", "A");
            printVal(payload, 92, 2, 1000, "CH0   - PF   ", "");
            printVal(payload, 94, 2,   10, "CH0   - T    ", "°C", false);
            printVal(payload, 96, 2,    1, "CH0   - EVT  ", "");
        } else {
            for(uint8_t i = 0; i < (pos-2); i+=2)
                printVal(payload, i, 2, 1, "?    -> CH?", "");
        }
    }
    else
        Serial.println("PAYLOAD CRC ERROR: " + String(crc, HEX) + " != " + String(recCrc, HEX));

}


//-----------------------------------------------------------------------------
void goRx() {
    spi3w.writeReg(CMT2300A_CUS_INT1_CTL, CMT2300A_INT_SEL_TX_DONE);

    uint8_t tmp = spi3w.readReg(CMT2300A_CUS_INT_CLR1);
    if(0x08 == tmp) // first time after TX this reg is 0x08
        spi3w.writeReg(CMT2300A_CUS_INT_CLR1, 0x04);
    else
        spi3w.writeReg(CMT2300A_CUS_INT_CLR1, 0x00);

    //if(0x10 == tmp)
    //    spi3w.writeReg(CMT2300A_CUS_INT_CLR2, 0x10);
    //else
    //    spi3w.writeReg(CMT2300A_CUS_INT_CLR2, 0x00);

    //spi3w.readReg(CMT2300A_CUS_FIFO_CTL); // necessary? -> if 0x02 last was read
                                          //                  0x07 last was write
    spi3w.writeReg(CMT2300A_CUS_FIFO_CTL, 0x02);

    spi3w.writeReg(CMT2300A_CUS_FIFO_CLR, 0x02);
    spi3w.writeReg(0x16, 0x0C); // [4:3]: RSSI_DET_SEL, [2:0]: RSSI_AVG_MODE

    //switchFreq();

    spi3w.writeReg(CMT2300A_CUS_FREQ_CHNL, 0x00); // 863.0 MHz

    if(!cmtSwitchStatus(CMT2300A_GO_RX, CMT2300A_STA_RX))
        Serial.println("warn: cant reach RX mode!");
}


