DanielR92/CMT2300A/RP2040/main.cpp
//-----------------------------------------------------------------------------
void getRx() {
    uint8_t state = spi3w.readReg(CMT2300A_CUS_INT_FLAG);
    if((state & 0x1b) == 0x1b) {
        if(!cmtSwitchStatus(CMT2300A_GO_STBY, CMT2300A_STA_STBY))
            Serial.println("warn: not switched to standby mode!");

        mFound = true;

        if(mRecId < 10) {
            mRxtime[mRecId] = millis() - mRxtime[mRecId];
            spi3w.readFifo(mRec[mRecId], 28);
            mRssi[mRecId] = spi3w.readReg(CMT2300A_CUS_RSSI_DBM) - 128;
            mRxFrag[(mRec[mRecId][10] & 0x7f) - 1] = true;
            if(mRec[mRecId][10] & 0x80 == 0x80)
                mMaxFragId = mRec[mRecId][10] & 0x7f;
            mRecId++;
        }
        //Serial.println("RX! mRecId: " + String(mRecId));
        //dumpBuf("RX", mRec[mRecId-1], 28, true);


        if(!cmtSwitchStatus(CMT2300A_GO_SLEEP, CMT2300A_STA_SLEEP))
            Serial.println("warn: not switched to sleep mode!");
    }
    else
        Serial.println("getRx wrong state: " + String(state, HEX));

    if(!cmtSwitchStatus(CMT2300A_GO_STBY, CMT2300A_STA_STBY))
        Serial.println("warn: not switched to standby mode!");

    goRx();
}


//-----------------------------------------------------------------------------
int8_t checkRx() {
    int8_t rssi = -128;
    /*if(CMT2300A_INT_SEL_TX_DONE != spi3w.readReg(CMT2300A_CUS_INT1_CTL))
        spi3w.writeReg(CMT2300A_CUS_INT1_CTL, CMT2300A_INT_SEL_TX_DONE);*/
    spi3w.readReg(CMT2300A_CUS_INT1_CTL);
    spi3w.writeReg(CMT2300A_CUS_INT1_CTL, CMT2300A_INT_SEL_TX_DONE);

        //if(0x00 == (spi3w.readReg(CMT2300A_CUS_INT_FLAG) & 0x0f))
        //spi3w.readReg(CMT2300A_CUS_INT_FLAG);
        {
            // no data received
            uint8_t tmp = spi3w.readReg(CMT2300A_CUS_INT_CLR1);
            if(0x08 == tmp) // first time after TX this reg is 0x08
                spi3w.writeReg(CMT2300A_CUS_INT_CLR1, 0x04);
            else
                spi3w.writeReg(CMT2300A_CUS_INT_CLR1, 0x00);

            if(0x10 == tmp)
                spi3w.writeReg(CMT2300A_CUS_INT_CLR2, 0x10);
            else
                spi3w.writeReg(CMT2300A_CUS_INT_CLR2, 0x00);

            spi3w.readReg(CMT2300A_CUS_FIFO_CTL); // necessary? -> if 0x02 last was read
                                                  //                  0x07 last was write
            spi3w.writeReg(CMT2300A_CUS_FIFO_CTL, 0x02);

            spi3w.writeReg(CMT2300A_CUS_FIFO_CLR, 0x02);
            spi3w.writeReg(0x16, 0x0C); // [4:3]: RSSI_DET_SEL, [2:0]: RSSI_AVG_MODE

            //switchFreq();

            spi3w.writeReg(CMT2300A_CUS_FREQ_CHNL, 0x00); // 863.0 MHz

            if(!cmtSwitchStatus(CMT2300A_GO_RX, CMT2300A_STA_RX))
                Serial.println("warn: cant reach RX mode!");
        }

        uint8_t state = 0x00;
            uint16_t timeout = 5000;
        for(uint8_t i = 0; i < 52; i++) {
            state = spi3w.readReg(CMT2300A_CUS_INT_FLAG);
            if(0x00 != state)
                break;
        }


        if((state & 0x10) == 0x10) {
            #ifdef RP2040
            while(0 == gpio_get(INTR_PIN)) {
            #else
            while(0 == digitalRead(INTR_PIN)) {
            #endif
                usleep(10);
                if(0 == --timeout) {
                    //Serial.println("GPIO timeout");
                    break;
                }
            }
            if(0 != timeout) {
                uint16_t timeout2 = 5000;
                while(0x18 != (state & 0x18)) {
                    state = spi3w.readReg(CMT2300A_CUS_INT_FLAG);
                    if(0 == timeout2--) {
                        //Serial.println("state timeout");
                        break;
                    }
                }
            }
        }


        #ifdef RP2040
            if(0 != gpio_get(INTR_PIN)) {
        #else
            if(0 != digitalRead(INTR_PIN)) {
        #endif
            uint32_t loops = 0;
            while((state & 0x1b) != 0x1b) {
                state = spi3w.readReg(CMT2300A_CUS_INT_FLAG);

                //if(state == 0x18)
                //    delay(23);

                if((state & 0x20) == 0x20) {
                    Serial.println("receive PKT ERROR");
                    break;
                }
                else if((state & 0x40) == 0x40) {
                    Serial.println("receive COL ERROR");
                    break;
                }

                if(++loops > 5000) {
                    //Serial.println("receive error, loops, state: " + String(state, HEX));
                    break;
                }
            }
        }


        // receive ok (pream, sync, node, crc)
        //uint8_t buf[28] = {0};
        if((state & 0x1b) == 0x1b) {
            if(!cmtSwitchStatus(CMT2300A_GO_STBY, CMT2300A_STA_STBY))
                Serial.println("warn: not switched to standby mode!");

            mFound = true;

            if(mRecId < 10) {
                mRxtime[mRecId] = millis() - mRxtime[mRecId];
                spi3w.readFifo(mRec[mRecId], 28);
                mRssi[mRecId] = spi3w.readReg(CMT2300A_CUS_RSSI_DBM) - 128;
                mRxFrag[(mRec[mRecId][10] & 0x7f) - 1] = true;
                mRecId++;
            }


            if(!cmtSwitchStatus(CMT2300A_GO_SLEEP, CMT2300A_STA_SLEEP))
                Serial.println("warn: not switched to sleep mode!");
        }

        /*if(0 != timeout)
            Serial.println("RX DONE!!! RSSI: " + String(rssi) + " remain cnt: " + String(timeout));
*/
        if((state & 0x1b) == 0x1b) {
            //Serial.println("mLastFreq: " + String(mLastFreq, HEX));
            //dumpBuf("RX", &buf[1], 27, false);

            //Serial.print(", RSSI: " + String(rssi));

            /*uint8_t len = buf[0] + 1;
            buf[len-0] = 0x00;
            if(buf[0] == 0x1b) {
                buf[len-2] = 0x00;
                buf[len-1] = 0x00;
                uint16_t crc2 = crc16(&buf[11], len-13, 0xffff);
                Serial.print(", crc16: " + String(crc2, HEX));
                buf[len-3] = (crc2 >> 8 & 0xff);
                buf[len-2] = (crc2      & 0xff);
            }
            Serial.println(", crc8: " + String(crc8(&buf[1], len-1), HEX));*/
        }
    //}


