DanielR92/CMT2300A/RP2040/main.cpp
    if(!cmtSwitchStatus(CMT2300A_GO_STBY, CMT2300A_STA_STBY))
        Serial.println("warn: not switched to standby mode!");

    return rssi;
}

//-----------------------------------------------------------------------------
void txData(uint8_t buf[], uint8_t len, bool calcCrc16 = true, bool calcCrc8 = true) {
    if((mRecId > 0) && (mLastRecId != mRecId)) {
        mLastRecId = mRecId;
    }

    if(mMaxFragId != 0) {
        bool complete = true;
        for(uint8_t i = 0; i < mMaxFragId; i++) {
            if(false == mRxFrag[i]) {
                complete = false;
                break;
            }
        }

        if(complete) {
            Serial.println("-----------------------------------");
            for(uint8_t i = 0; i < mRecId; i++) {
                dumpBuf("RX", mRec[i], 28, false);
                Serial.print(" | " + String(mRxtime[i]));
                Serial.println("ms | " + String(mRssi[i]) + "dBm");
            }
            Serial.println("complete!");
            build();
        }
        else
            Serial.println("failed!, max: " + String(mMaxFragId));
    }

    // reset
    memset(mRec, 0xcc, 10*32);
    for(uint8_t i = 0; i < 10; i++) {
        mRxtime[i] = millis();
        mRxFrag[i] = false;
    }
    mRecId = 0;
    mRetransmits = 0;
    mLastRecId = 0;
    mMaxFragId = 0;


    // prepare buf
    if(calcCrc16) {
        buf[len-3] = 0x00;
        buf[len-2] = 0x00;
        buf[len-1] = 0x00;
        uint16_t crc2 = crc16(&buf[10], len-13, 0xffff);
        buf[len-3] = (crc2 >> 8 & 0xff);
        buf[len-2] = (crc2      & 0xff);
    }
    if(calcCrc8)
        buf[len-1] = crc8(buf, len-1);
    dumpBuf("TX", buf, len);


    // verify that write pipe is empty
    /*if(verify == true) {
        spi3w.writeReg(0x16, 0x04); // [4:3]: RSSI_DET_SEL, [2:0]: RSSI_AVG_MODE
        //spi3w.writeReg(CMT2300A_CUS_FREQ_CHNL, 0x00);

        if(!cmtSwitchStatus(CMT2300A_GO_RX, CMT2300A_STA_RX))
            Serial.println("warn: cant reach RX mode!");

        for(uint8_t i = 0; i < 50; i++) {
            spi3w.readReg(CMT2300A_CUS_RSSI_DBM);
            spi3w.readReg(CMT2300A_CUS_INT1_CTL);
            if(0x00 != spi3w.readReg(CMT2300A_CUS_INT_FLAG)) {
                Serial.println("TX: CMT2300A_CUS_INT_FLAG is not 0!: " + String(spi3w.readReg(CMT2300A_CUS_INT_FLAG), HEX));

                spi3w.writeReg(CMT2300A_CUS_INT_CLR1, 0x00);
                spi3w.writeReg(CMT2300A_CUS_INT_CLR2, 0x00);
                return;
            }
            spi3w.readReg(CMT2300A_CUS_INT_CLR1);
            spi3w.writeReg(CMT2300A_CUS_INT_CLR1, 0x00);
            spi3w.writeReg(CMT2300A_CUS_INT_CLR2, 0x00);
        }

        if(!cmtSwitchStatus(CMT2300A_GO_STBY, CMT2300A_STA_STBY))
            Serial.println("warn: not switched to standby mode!");
        // verify end
    }*/



    if(!cmtSwitchStatus(CMT2300A_GO_STBY, CMT2300A_STA_STBY))
        Serial.println("warn: not switched to standby mode!");

    //if(CMT2300A_INT_SEL_TX_DONE != spi3w.readReg(CMT2300A_CUS_INT1_CTL))
    //    spi3w.writeReg(CMT2300A_CUS_INT1_CTL, CMT2300A_INT_SEL_TX_DONE);
    //spi3w.readReg(CMT2300A_CUS_INT1_CTL);
    spi3w.writeReg(CMT2300A_CUS_INT1_CTL, CMT2300A_INT_SEL_TX_DONE);

    //if(0x00 == spi3w.readReg(CMT2300A_CUS_INT_FLAG))
    {
        // no data received
        //spi3w.readReg(CMT2300A_CUS_INT_CLR1);
        spi3w.writeReg(CMT2300A_CUS_INT_CLR1, 0x00);
        spi3w.writeReg(CMT2300A_CUS_INT_CLR2, 0x00);

        //spi3w.readReg(CMT2300A_CUS_FIFO_CTL); // necessary?
        spi3w.writeReg(CMT2300A_CUS_FIFO_CTL, 0x07);

        spi3w.writeReg(CMT2300A_CUS_FIFO_CLR, 0x01);

        //if(0x01 != spi3w.readReg(0x45))
        //    Serial.println("reg 0x45 must be 0x01!");
        //spi3w.writeReg(0x45, 0x01);
        spi3w.writeReg(0x46, len); // payload length

        spi3w.writeFifo(buf, len);

        if(!mFound && (len == 15)) {
            if(++mDec == 4) {
                switchFreq();
                mDec = 0;
            }
        } else
            spi3w.writeReg(CMT2300A_CUS_FREQ_CHNL, 0x00); // 863.0 MHz


        if(!cmtSwitchStatus(CMT2300A_GO_TX, CMT2300A_STA_TX))
            Serial.println("warn: cant reach TX mode!");

        // wait for tx done
        while(CMT2300A_MASK_TX_DONE_FLG != spi3w.readReg(CMT2300A_CUS_INT_CLR1)) {
            yield();
            //sleep_us(10);
        }

        delay(1);

        if(!cmtSwitchStatus(CMT2300A_GO_STBY, CMT2300A_STA_STBY))
            Serial.println("warn: not switched to standby mode!");
    }
}

//-----------------------------------------------------------------------------
void resetCMT(void) {
    spi3w.writeReg(0x7f, 0xff); // soft reset
    delay(30);

    // go to standby mode
    if(cmtSwitchStatus(CMT2300A_GO_STBY, CMT2300A_STA_STBY))
        Serial.println("standby mode reached");

    if(0xAA != spi3w.readReg(0x48))
        spi3w.writeReg(0x48, 0xAA);
    spi3w.readReg(0x48);
    spi3w.writeReg(0x4c, 0x00);

    if(0x52 != spi3w.readReg(CMT2300A_CUS_MODE_STA)) // 0x62
        spi3w.writeReg(CMT2300A_CUS_MODE_STA, 0x52);
    if(0x20 != spi3w.readReg(0x62))
        spi3w.writeReg(0x62, 0x20);
    spi3w.readReg(0x0D);
    spi3w.writeReg(0x0F, 0x00);


    ///////////////////

    spi3w.writeReg(0x00, 0x00);
    spi3w.writeReg(0x01, 0x66);
    spi3w.writeReg(0x02, 0xEC);
    spi3w.writeReg(0x03, 0x1D);
    spi3w.writeReg(0x04, 0x70);
    spi3w.writeReg(0x05, 0x80);
    spi3w.writeReg(0x06, 0x14);
    spi3w.writeReg(0x07, 0x08);
    spi3w.writeReg(0x08, 0x91);
    spi3w.writeReg(0x09, 0x02);
    spi3w.writeReg(0x0A, 0x02);
    spi3w.writeReg(0x0B, 0xD0);
    spi3w.writeReg(0x0C, 0xAE);
    spi3w.writeReg(0x0D, 0xE0);
    spi3w.writeReg(0x0E, 0x35);
    spi3w.writeReg(0x0F, 0x00);

    spi3w.writeReg(0x10, 0x00);
    spi3w.writeReg(0x11, 0xF4);
    spi3w.writeReg(0x12, 0x10);
    spi3w.writeReg(0x13, 0xE2);
    spi3w.writeReg(0x14, 0x42);
    spi3w.writeReg(0x15, 0x20);
    spi3w.writeReg(0x16, 0x0C); // [4:3]: RSSI_DET_SEL, [2:0]: RSSI_AVG_MODE
    spi3w.writeReg(0x17, 0x81);
    spi3w.writeReg(0x18, 0x42);
    spi3w.writeReg(0x19, 0xCF);
    spi3w.writeReg(0x1A, 0xA7);
    spi3w.writeReg(0x1B, 0x8C);
    spi3w.writeReg(0x1C, 0x42);
    spi3w.writeReg(0x1D, 0xC4);
    spi3w.writeReg(0x1E, 0x4E);
    spi3w.writeReg(0x1F, 0x1C);

    spi3w.writeReg(0x20, 0xA6);
    spi3w.writeReg(0x21, 0xC9);
    spi3w.writeReg(0x22, 0x20);
    spi3w.writeReg(0x23, 0x20);
    spi3w.writeReg(0x24, 0xD2);
    spi3w.writeReg(0x25, 0x35);
    spi3w.writeReg(0x26, 0x0C);
    spi3w.writeReg(0x27, 0x0A);
    spi3w.writeReg(0x28, 0x9F);
    spi3w.writeReg(0x29, 0x4B);
    spi3w.writeReg(0x2A, 0x29);
    spi3w.writeReg(0x2B, 0x29);
    spi3w.writeReg(0x2C, 0xC0);
    spi3w.writeReg(0x2D, 0x14);
    spi3w.writeReg(0x2E, 0x05);
    spi3w.writeReg(0x2F, 0x53);

    spi3w.writeReg(0x30, 0x10);
    spi3w.writeReg(0x31, 0x00);
    spi3w.writeReg(0x32, 0xB4);
    spi3w.writeReg(0x33, 0x00);
    spi3w.writeReg(0x34, 0x00);
    spi3w.writeReg(0x35, 0x01);
    spi3w.writeReg(0x36, 0x00);
    spi3w.writeReg(0x37, 0x00);
    spi3w.writeReg(0x38, 0x12);
    spi3w.writeReg(0x39, 0x1E);
    spi3w.writeReg(0x3A, 0x00);
    spi3w.writeReg(0x3B, 0xAA);
    spi3w.writeReg(0x3C, 0x06);
    spi3w.writeReg(0x3D, 0x00);
    spi3w.writeReg(0x3E, 0x00);
    spi3w.writeReg(0x3F, 0x00);

    spi3w.writeReg(0x40, 0x00);
    spi3w.writeReg(0x41, 0xD6);
    spi3w.writeReg(0x42, 0xD5);
    spi3w.writeReg(0x43, 0xD4);
    spi3w.writeReg(0x44, 0x2D);
    spi3w.writeReg(0x45, 0x01);
    spi3w.writeReg(0x46, 0x1D);
    spi3w.writeReg(0x47, 0x00);
    spi3w.writeReg(0x48, 0x00);
    spi3w.writeReg(0x49, 0x00);
    spi3w.writeReg(0x4A, 0x00);
    spi3w.writeReg(0x4B, 0x00);
    spi3w.writeReg(0x4C, 0xC3);
    spi3w.writeReg(0x4D, 0x00);
    spi3w.writeReg(0x4E, 0x00);
    spi3w.writeReg(0x4F, 0x60);

    spi3w.writeReg(0x50, 0xFF);
    spi3w.writeReg(0x51, 0x00);
    spi3w.writeReg(0x52, 0x00);
    spi3w.writeReg(0x53, 0x1F);
    spi3w.writeReg(0x54, 0x10);
    spi3w.writeReg(0x55, 0x70);
    spi3w.writeReg(0x56, 0x4D);
    spi3w.writeReg(0x57, 0x06);
    spi3w.writeReg(0x58, 0x00);
    spi3w.writeReg(0x59, 0x07);
    spi3w.writeReg(0x5A, 0x50);
    spi3w.writeReg(0x5B, 0x00);
    spi3w.writeReg(0x5C, 0x8A);
    spi3w.writeReg(0x5D, 0x18);
    spi3w.writeReg(0x5E, 0x3F);
    spi3w.writeReg(0x5F, 0x7F);

